<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"http","label":"production","backend":"d061390d3e6bd3cdf95d997e2c867d2ba0e100577575ccbdb1ac7187a49c0fca","plan_job_ref":"Job Cloudflare Infra #10 at https://github.com/SableClient/Sable/actions/runs/22979395414","plan_out_hash":"7cf3373c02ee23b791c7b5c14fa35957b12cba81ca6af8056eec3ae0e01523e9","plan_hash":"f8ff32a4c2d2307b76f40f32081d297a1200cce2be7b7ae1892954acf27ceefc","plan_text_format":"diff","version":"2.2.3"} -->
OpenTofu plan for __production__
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # cloudflare_worker_version.site must be replaced
-/+ resource "cloudflare_worker_version" "site" {
!~      annotations         = {
+           workers_message      = (known after apply)
+           workers_tag          = (known after apply)
!~          workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
!~      assets              = { # forces replacement
!~          asset_manifest_sha256 = "571894a54b399bef7a5c40ab051dc6886b2bc8e182571076198b96e31efe3158" -> "208936986da65166884ed92e3f2799eaf80b2f36643ce23fd65a3c8dad9faee1" # forces replacement
!~          directory             = "/home/runner/work/Sable/Sable/dist" -> "/github/workspace/dist"
#            (1 unchanged attribute hidden)
        }
+       compatibility_flags = (known after apply)
!~      created_on          = "2026-03-10T06:07:19Z" -> (known after apply)
!~      id                  = "************************************" -> (known after apply)
+       limits              = (known after apply)
+       main_script_base64  = (known after apply)
!~      number              = 2 -> (known after apply)
!~      source              = "terraform" -> (known after apply)
+       startup_time_ms     = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # cloudflare_workers_deployment.site must be replaced
-/+ resource "cloudflare_workers_deployment" "site" {
!~      annotations  = { # forces replacement
!~          workers_message      = <<-EOT
              - Merge pull request #126 from SableClient/prepare-release
              - 
              - prepare release
              + fix: docker images
            EOT
!~          workers_triggered_by = "deployment" -> (known after apply)
        }
!~      author_email = "cloudflare@sl.sable.moe" -> (known after apply)
!~      created_on   = "2026-03-10T06:07:20Z" -> (known after apply)
!~      id           = "************************************" -> (known after apply)
!~      source       = "terraform" -> (known after apply)
!~      versions     = [ # forces replacement
!~          {
!~              version_id = "************************************" -> (known after apply)
#                (1 unchanged attribute hidden)
            },
        ]
#        (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Warning: Attribute Deprecated

  with cloudflare_workers_custom_domain.site,
  on main.tf line 41, in resource "cloudflare_workers_custom_domain" "site":
  41:   environment = "production"

This attribute is deprecated.

(and one more similar warning elsewhere)
```
</details>

:memo: Plan generated in [Cloudflare Infra #10](https://github.com/SableClient/Sable/actions/runs/22979395414)